
public class Main {
    public static void main(String[] args) {
        //Ввести целое число в консоли и вывести на экран последнюю цифру введенного числа
        AfirstEx.run();           //Задание 1
        //Ввести целое трехзначное число в консоли и найти сумму цифр этого трехзначного числа
        BsecondEx.run();          //Задание 2
        //Ввести целое число в консоли. Если оно является положительным, то прибавить к нему 1,
        // в противном случае не изменять его. Вывести полученное число
        CthirdEx.run();           //Задание 3
        //Ввести целое число в консоли. Если оно является положительным, то прибавить к нему 1;
        // если отрицательным, то вычесть из него 2; если нулевым, то заменить его на 10. Вывести полученное число
        DfourEx.run();            //Задание 4
        //Ввести три целых числа с консоли. Вывести на экран наименьшее из них
        EfiveEx.run();//Задание 5
        //Ввести целое число в консоли. Вывести его строку-описание вида «отрицательное четное число»,
        // «нулевое число», «положительное нечетное число» и т. д.
        FsixEx.run();             //Задание 6
        //Написать программу, вычисляющую стоимость 10 минутного междугороднего разговора в зависимости от кода города.
        // (Москва(905) - 4.15 руб. Ростов(194) - 1.98 руб. Краснодар(491) - 2.69 руб. Киров(800) - 5.00руб.)
        GsevenEx.run();           //Задание 7
        //Для данного массива найти и вывести на экран: максимальное значение, сумму положительных элементов,
        // сумму четных отрицательных элементов, количество положительных элементов, среднее арифметическое отрицательных элементов
        HeightEx.run();           //Задание 8
        //Переставить элементы массива в обратном порядке. Вывести результат в консоль
        InineEx.run();       //Задание 9
        //Переместить нули в конец массива. Вывести результат в консоль
        JtenEx.run();             //Задание 10
    }
}